const interestObj = {
    アート: {
        アート分野: ["デジタルアート", "メディアアート", "トリックアート"],
        アプリケーション: ["Flash (ActionScript)", "Illustrator"],
        音楽ジャンル: [
            "テクノ(Electronic)",
            "ドラムンベース",
            "IDM",
            "Chiptune",
        ],
        ミュージシャン: [
            "Autechre",
            "Aphex Twin",
            "Underworld",
            "電気グルーヴ",
            "DE DE MOUSE",
            "P-MODEL",
            "ケンモチヒデフミ",
            "ππ来来",
            "長瀬有花",
            "Yunomi",
        ],
        FF: ["Final Fantasy", "植松伸夫", "崎元仁", "野村哲也", "吉田明彦"],
        文字: ["フォント"],
    },
    研究: {
        画像: ["画像処理", "曲線", "ベクタ画像", "アンチエイリアシング"],
        信号処理: [
            "サンプリング",
            "フーリエ変換",
            "解析信号",
            "ヒルベルト変換",
        ],
        計算: [
            "数式処理",
            "Wolfram言語 (Mathematica)",
            "プロット",
            "2進数",
            "記数法",
            "演算器",
        ],
        異次元: ["4次元", "フラクタル", "再帰曲線", "ドラゴン曲線"],
        フィボナッチ: ["黄金比", "フィボナッチ数"],
        哲学: ["哲学", "心理学", "認知科学", "顔"],
        AI: ["人工知能", "言語理解"],
        問題: [
            "グラフ理論",
            "巡回セールスマン問題",
            "コラッツ予想（3n+1問題）",
        ],
        スピリチュアル: [
            "神聖数理学",
            "FLKMchain(mod 9)",
            "陰陽五行",
            "ピタゴラス数秘術",
            "数意学",
        ],
        ソーシャル: ["ブロックチェーン", "メタバース", "NFT"],
    },
    技術: {
        言語: ["HTML", "JavaScript", "Unity"],
        フォーマット: ["JSON", "XML", "MathML", "SVG"],
    },
    その他趣味: {
        0: ["甘味"],
        1: ["漢字"],
        2: ["ライフログ"],
    },
}

export default interestObj
